benchmarks/stationaryBubble/quadrant/system/ijkDict
{
cellSet domain;
symXIn true;
symXOut true;
symYIn true;
symYOut true;
}